9/data/attachments/ed74e82d17527eb.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_55dab93f-d953-4d3c-b263-393af3026043</nif:username>
            <nif:friendToBeAdded>Joseph_paper_Actions_53209_1</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>